In [1]:
%load_ext sql

In [2]:
%sql sqlite:///db_univ7.db

### To Check DB

In [3]:
%sql select * from sqlite_master

 * sqlite:///db_univ7.db
Done.

[('table', 'classroom', 'classroom', 2, 'CREATE TABLE classroom\n\t(building\t\tvarchar(15),\n\t room_number\t\tvarchar(7),\n\t capacity\t\tnumeric(4,0),\n\t primary key (building, room_number)\n\t)'),
 ('index', 'sqlite_autoindex_classroom_1', 'classroom', 3, None),
 ('table', 'department', 'department', 4, 'CREATE TABLE department\n\t(dept_name\t\tvarchar(20), \n\t building\t\tvarchar(15), \n\t budget\t\t        numeric(12,2) check (budget > 0),\n\t primary key (dept_name)\n\t)'),
 ('index', 'sqlite_autoindex_department_1', 'department', 5, None),
 ('table', 'course', 'course', 6, 'CREATE TABLE course\n\t(course_id\t\tvarchar(8), \n\t title\t\t\tvarchar(50), \n\t dept_name\t\tvarchar(20),\n\t credits\t\tnumeric(2,0) check (credits > 0),\n\t primary key (course_id),\n\t foreign key (dept_name) references department (dept_name)\n\t\ton delete set null\n\t)'),
 ('index', 'sqlite_autoindex_course_1', 'course', 7, None),
 ('table', 'instructor', 'instructor', 8, 'CREATE TABLE instructor\n\t(ID\t\t\tvarchar(5), \n\t name\t\t\tvarchar(20) not null, \n\t dept_name\t\tvarchar(20), \n\t salary\t\t\tnumeric(8,2) check (salary > 29000),\n\t primary key (ID),\n\t foreign key (dept_name) references department (dept_name)\n\t\ton delete set null\n\t)'),
 ('index', 'sqlite_autoindex_instructor_1', 'instructor', 9, None),
 ('table', 'section', 'section', 10, "CREATE TABLE section\n\t(course_id\t\tvarchar(8), \n         sec_id\t\t\tvarchar(8),\n\t semester\t\tvarchar(6)\n\t\tcheck (semester in ('Fall', 'Win ... (285 characters truncated) ... (course_id)\n\t\ton delete cascade,\n\t foreign key (building, room_number) references classroom (building, room_number)\n\t\ton delete set null\n\t)"),
 ('index', 'sqlite_autoindex_section_1', 'section', 11, None),
 ('table', 'teaches', 'teaches', 12, 'CREATE TABLE teaches\n\t(ID\t\t\tvarchar(5), \n\t course_id\t\tvarchar(8),\n\t sec_id\t\t\tvarchar(8), \n\t semester\t\tvarchar(6),\n\t year\t\t\tnum ... (125 characters truncated) ... ences section (course_id, sec_id, semester, year)\n\t\ton delete cascade,\n\t foreign key (ID) references instructor (ID)\n\t\ton delete cascade\n\t)'),
 ('index', 'sqlite_autoindex_teaches_1', 'teaches', 13, None),
 ('table', 'student', 'student', 14, 'CREATE TABLE student\n\t(ID\t\t\tvarchar(5), \n\t name\t\t\tvarchar(20) not null, \n\t dept_name\t\tvarchar(20), \n\t tot_cred\t\tnumeric(3,0) check (tot_cred >= 0),\n\t primary key (ID),\n\t foreign key (dept_name) references department (dept_name)\n\t\ton delete set null\n\t)'),
 ('index', 'sqlite_autoindex_student_1', 'student', 15, None),
 ('table', 'takes', 'takes', 16, 'CREATE TABLE takes\n\t(ID\t\t\tvarchar(5), \n\t course_id\t\tvarchar(8),\n\t sec_id\t\t\tvarchar(8), \n\t semester\t\tvarchar(6),\n\t year\t\t\tnumer ... (153 characters truncated) ... ferences section (course_id, sec_id, semester, year)\n\t\ton delete cascade,\n\t foreign key (ID) references student (ID)\n\t\ton delete cascade\n\t)'),
 ('index', 'sqlite_autoindex_takes_1', 'takes', 17, None),
 ('table', 'advisor', 'advisor', 18, 'CREATE TABLE advisor\n\t(s_ID\t\t\tvarchar(5),\n\t i_ID\t\t\tvarchar(5),\n\t primary key (s_ID),\n\t foreign key (i_ID) references instructor (ID)\n\t\ton delete set null,\n\t foreign key (s_ID) references student (ID)\n\t\ton delete cascade\n\t)'),
 ('index', 'sqlite_autoindex_advisor_1', 'advisor', 19, None),
 ('table', 'time_slot', 'time_slot', 20, 'CREATE TABLE time_slot\n\t(time_slot_id\t\tvarchar(4),\n\t day\t\t\tvarchar(1),\n\t start_hr\t\tnumeric(2) check (start_hr >= 0 and start_hr < 24),\n ... (111 characters truncated) ... >= 0 and end_hr < 24),\n\t end_min\t\tnumeric(2) check (end_min >= 0 and end_min < 60),\n\t primary key (time_slot_id, day, start_hr, start_min)\n\t)'),
 ('index', 'sqlite_autoindex_time_slot_1', 'time_slot', 21, None),
 ('table', 'prereq', 'prereq', 22, 'CREATE TABLE prereq\n\t(course_id\t\tvarchar(8), \n\t prereq_id\t\tvarchar(8),\n\t primary key (course_id, prereq_id),\n\t foreign key (course_id) references course (course_id)\n\t\ton delete cascade,\n\t foreign key (prereq_id) references course (course_id)\n\t)'),
 ('index', 'sqlite_autoindex_prereq_1', 'prereq', 23, None)]

In [4]:
%sql select * from course

 * sqlite:///db_univ7.db
Done.

[('BIO-101', 'Intro. to Biology', 'Biology', 4),
 ('BIO-301', 'Genetics', 'Biology', 4),
 ('BIO-399', 'Computational Biology', 'Biology', 3),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', 4),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3),
 ('CS-319', 'Image Processing', 'Comp. Sci.', 3),
 ('CS-347', 'Database System Concepts', 'Comp. Sci.', 3),
 ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', 3),
 ('FIN-201', 'Investment Banking', 'Finance', 3),
 ('HIS-351', 'World History', 'History', 3),
 ('MU-199', 'Music Video Production', 'Music', 3),
 ('PHY-101', 'Physical Principles', 'Physics', 4)]

In [5]:
%%sql
select * from section 
order by course_id,year, semester

 * sqlite:///db_univ7.db
Done.

[('BIO-101', '1', 'Summer', 2017, 'Painter', '514', 'B'),
 ('BIO-301', '1', 'Summer', 2018, 'Painter', '514', 'A'),
 ('CS-101', '1', 'Fall', 2017, 'Packard', '101', 'H'),
 ('CS-101', '1', 'Spring', 2018, 'Packard', '101', 'F'),
 ('CS-190', '1', 'Spring', 2017, 'Taylor', '3128', 'E'),
 ('CS-190', '2', 'Spring', 2017, 'Taylor', '3128', 'A'),
 ('CS-315', '1', 'Spring', 2018, 'Watson', '120', 'D'),
 ('CS-319', '1', 'Spring', 2018, 'Watson', '100', 'B'),
 ('CS-319', '2', 'Spring', 2018, 'Taylor', '3128', 'C'),
 ('CS-347', '1', 'Fall', 2017, 'Taylor', '3128', 'A'),
 ('EE-181', '1', 'Spring', 2017, 'Taylor', '3128', 'C'),
 ('FIN-201', '1', 'Spring', 2018, 'Packard', '101', 'B'),
 ('HIS-351', '1', 'Spring', 2018, 'Painter', '514', 'C'),
 ('MU-199', '1', 'Spring', 2018, 'Packard', '101', 'D'),
 ('PHY-101', '1', 'Fall', 2017, 'Watson', '100', 'A')]

In [6]:
%sql select * from student

 * sqlite:///db_univ7.db
Done.

[('00128', 'Zhang', 'Comp. Sci.', 102),
 ('12345', 'Shankar', 'Comp. Sci.', 32),
 ('19991', 'Brandt', 'History', 80),
 ('23121', 'Chavez', 'Finance', 110),
 ('44553', 'Peltier', 'Physics', 56),
 ('45678', 'Levy', 'Physics', 46),
 ('54321', 'Williams', 'Comp. Sci.', 54),
 ('55739', 'Sanchez', 'Music', 38),
 ('70557', 'Snow', 'Physics', 0),
 ('76543', 'Brown', 'Comp. Sci.', 58),
 ('76653', 'Aoi', 'Elec. Eng.', 60),
 ('98765', 'Bourikas', 'Elec. Eng.', 98),
 ('98988', 'Tanaka', 'Biology', 120)]

In [7]:
%sql select * from instructor

 * sqlite:///db_univ7.db
Done.

[('10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('12121', 'Wu', 'Finance', 90000),
 ('15151', 'Mozart', 'Music', 40000),
 ('22222', 'Einstein', 'Physics', 95000),
 ('32343', 'El Said', 'History', 60000),
 ('33456', 'Gold', 'Physics', 87000),
 ('45565', 'Katz', 'Comp. Sci.', 75000),
 ('58583', 'Califieri', 'History', 62000),
 ('76543', 'Singh', 'Finance', 80000),
 ('76766', 'Crick', 'Biology', 72000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000),
 ('98345', 'Kim', 'Elec. Eng.', 80000)]

In [8]:
%%sql
select * from takes
order by year, semester,course_id

 * sqlite:///db_univ7.db
Done.

[('00128', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('12345', 'CS-101', '1', 'Fall', 2017, 'C'),
 ('45678', 'CS-101', '1', 'Fall', 2017, 'F'),
 ('54321', 'CS-101', '1', 'Fall', 2017, 'A-'),
 ('76543', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('98765', 'CS-101', '1', 'Fall', 2017, 'C-'),
 ('00128', 'CS-347', '1', 'Fall', 2017, 'A-'),
 ('12345', 'CS-347', '1', 'Fall', 2017, 'A'),
 ('44553', 'PHY-101', '1', 'Fall', 2017, 'B-'),
 ('12345', 'CS-190', '2', 'Spring', 2017, 'A'),
 ('54321', 'CS-190', '2', 'Spring', 2017, 'B+'),
 ('76653', 'EE-181', '1', 'Spring', 2017, 'C'),
 ('98988', 'BIO-101', '1', 'Summer', 2017, 'A'),
 ('45678', 'CS-101', '1', 'Spring', 2018, 'B+'),
 ('12345', 'CS-315', '1', 'Spring', 2018, 'A'),
 ('98765', 'CS-315', '1', 'Spring', 2018, 'B'),
 ('45678', 'CS-319', '1', 'Spring', 2018, 'B'),
 ('76543', 'CS-319', '2', 'Spring', 2018, 'A'),
 ('23121', 'FIN-201', '1', 'Spring', 2018, 'C+'),
 ('19991', 'HIS-351', '1', 'Spring', 2018, 'B'),
 ('55739', 'MU-199', '1', 'Spring', 2018, 'A-'),
 ('98988', 'BIO-301', '1', 'Summer', 2018, None)]

In [9]:
%sql select * from teaches

 * sqlite:///db_univ7.db
Done.

[('10101', 'CS-101', '1', 'Fall', 2017),
 ('10101', 'CS-315', '1', 'Spring', 2018),
 ('10101', 'CS-347', '1', 'Fall', 2017),
 ('12121', 'FIN-201', '1', 'Spring', 2018),
 ('15151', 'MU-199', '1', 'Spring', 2018),
 ('22222', 'PHY-101', '1', 'Fall', 2017),
 ('32343', 'HIS-351', '1', 'Spring', 2018),
 ('45565', 'CS-101', '1', 'Spring', 2018),
 ('45565', 'CS-319', '1', 'Spring', 2018),
 ('76766', 'BIO-101', '1', 'Summer', 2017),
 ('76766', 'BIO-301', '1', 'Summer', 2018),
 ('83821', 'CS-190', '1', 'Spring', 2017),
 ('83821', 'CS-190', '2', 'Spring', 2017),
 ('83821', 'CS-319', '2', 'Spring', 2018),
 ('98345', 'EE-181', '1', 'Spring', 2017)]

----

In [10]:
%%sql /*Problem 1-1*/
select title 
from course
where dept_name='Comp. Sci.' and credits=3

 * sqlite:///db_univ7.db
Done.

[('Robotics',), ('Image Processing',), ('Database System Concepts',)]

In [11]:
%%sql /*Problem 1-2*/
select distinct S.ID
from student as S, takes as T
where T.course_ID = (select teaches.course_ID
                     from instructor,teaches
                     where name = 'Einstein' and instructor.ID =  teaches.ID)
    and S.ID = T.ID

 * sqlite:///db_univ7.db
Done.

[('44553',)]

In [12]:
%%sql /*Problem 1-3*/
select max(salary) 
from instructor

 * sqlite:///db_univ7.db
Done.

[(95000,)]

In [13]:
%%sql /*Problem 1-4*/
select name
from instructor
where salary = (select max(salary) from instructor)

 * sqlite:///db_univ7.db
Done.

[('Einstein',)]

In [14]:
%%sql /*Problem 1-5*/
select course_id, sec_id, count(sec_id) as enrollment
from takes natural join section
where semester = 'Fall' and year = '2017'
group by course_id

 * sqlite:///db_univ7.db
Done.

[('CS-101', '1', 6), ('CS-347', '1', 2), ('PHY-101', '1', 1)]

In [15]:
%%sql /*Problem 1-6*/
create view count as
select course_id, sec_id, count(course_id) as enrollment
from takes natural join section
where semester = 'Fall' and year = '2017'
group by course_id

 * sqlite:///db_univ7.db
Done.

[]

In [16]:
%%sql
select max(enrollment)
from count

 * sqlite:///db_univ7.db
Done.

[(6,)]

In [17]:
%%sql /*Problem 1-7*/
select course_id,sec_id
from count
where enrollment in (select max(enrollment)
                     from count)

 * sqlite:///db_univ7.db
Done.

[('CS-101', '1')]

In [2]:
%sql sqlite:///insurance.db

In [3]:
%%sql /*Problem 2*/
create table person(
    driver_id   char(5),
    name        varchar(20) not null,
    address     varchar(20),
    primary key(driver_id)
);

create table car(
    license_plate   char(8),
    model           varchar(10),
    year            numeric(4,0) check(year>1900 and year<2100),
    primary key(license_plate)
);

create table accident(
    report_number   char(6),
    year            numeric(4,0) check(year>1900 and year<2100),
    location        varchar(20),
    primary key(report_number)    
);

create table owns(
    driver_id       char(5),
    license_plate   char(8),
    primary key(driver_id,license_plate),
    foreign key(driver_id) references person,
    foreign key(license_plate) references car
);

create table participated(
    report_number   char(6),
    license_plate   char(8),
    driver_id       char(5),
    damage_amount   numeric(7,0),
    primary key(report_number,license_plate),
    foreign key(report_number) references accident,
    foreign key(license_plate) references car,
    foreign key(driver_id) references person
);

 * sqlite:///insurance.db
Done.
Done.
Done.
Done.
Done.

[]

In [4]:
%%sql /*Problem 3-1*/
insert into person values('29538','John Smith','Seoul');
insert into person values('12345','Brianne Howey','Daejeon');
insert into person values('58033','Chris Brown','Gwangju');
insert into person values('82592','Filip Tysander','Ulsan');
insert into person values('78608','Erick Carreira','Daegu');

 * sqlite:///insurance.db
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [5]:
%%sql
insert into car values('AABB2000','Ferrari','2018');
insert into car values('UFNE8210','Benz','2010');
insert into car values('TDWU0421','Ford','2012');
insert into car values('CSYF1980','BMW','2013');
insert into car values('OMSH1732','Morning','2008');

 * sqlite:///insurance.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [6]:
%%sql
insert into accident values('AR2197','2021','Seoul');
insert into accident values('HE4884','2012','Daejeon');
insert into accident values('QW2197','2021','Gwangju');
insert into accident values('XE8732','2013','Ulsan');
insert into accident values('HU2309','2018','Daegu');

 * sqlite:///insurance.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [7]:
%%sql
insert into owns values('29538','AABB2000');
insert into owns values('12345','UFNE8210');
insert into owns values('58033','TDWU0421');
insert into owns values('82592','CSYF1980');
insert into owns values('78608','OMSH1732');

 * sqlite:///insurance.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [8]:
%%sql
insert into participated values('QW2197','TDWU0421','58033','1700');
insert into participated values('HE4884','UFNE8210','12345','2300');
insert into participated values('AR2197','AABB2000','29538','2700');
insert into participated values('XE8732','CSYF1980','82592','2100');
insert into participated values('HU2309','OMSH1732','78608','500');

 * sqlite:///insurance.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [9]:
%%sql /*Problem 3-2*/
select * from person

 * sqlite:///insurance.db
Done.

[('29538', 'John Smith', 'Seoul'),
 ('12345', 'Brianne Howey', 'Daejeon'),
 ('58033', 'Chris Brown', 'Gwangju'),
 ('82592', 'Filip Tysander', 'Ulsan'),
 ('78608', 'Erick Carreira', 'Daegu')]

In [10]:
%%sql /*Problem 3-3*/ 
select * from car

 * sqlite:///insurance.db
Done.

[('AABB2000', 'Ferrari', 2018),
 ('UFNE8210', 'Benz', 2010),
 ('TDWU0421', 'Ford', 2012),
 ('CSYF1980', 'BMW', 2013),
 ('OMSH1732', 'Morning', 2008)]

In [11]:
%%sql /*Problem 3-4*/ 
select * from accident

 * sqlite:///insurance.db
Done.

[('AR2197', 2021, 'Seoul'),
 ('HE4884', 2012, 'Daejeon'),
 ('QW2197', 2021, 'Gwangju'),
 ('XE8732', 2013, 'Ulsan'),
 ('HU2309', 2018, 'Daegu')]

In [12]:
%%sql /*Problem 3-5*/ 
select * from owns

 * sqlite:///insurance.db
Done.

[('29538', 'AABB2000'),
 ('12345', 'UFNE8210'),
 ('58033', 'TDWU0421'),
 ('82592', 'CSYF1980'),
 ('78608', 'OMSH1732')]

In [13]:
%%sql /*Problem 3-6*/ 
select * from participated

 * sqlite:///insurance.db
Done.

[('QW2197', 'TDWU0421', '58033', 1700),
 ('HE4884', 'UFNE8210', '12345', 2300),
 ('AR2197', 'AABB2000', '29538', 2700),
 ('XE8732', 'CSYF1980', '82592', 2100),
 ('HU2309', 'OMSH1732', '78608', 500)]

In [14]:
%%sql /*Problem 4*/
select count(driver_id)
from owns
where license_plate in (select license_plate
                        from accident natural join participated
                        where year = '2021')

 * sqlite:///insurance.db
Done.

[(2,)]

In [15]:
%%sql /*Problem 5*/
select count(report_number)
from participated
where license_plate in (select license_plate
                        from person natural join owns
                        where name = 'John Smith')

 * sqlite:///insurance.db
Done.

[(1,)]

In [16]:
%%sql /*Problem 6*/
delete from owns
where driver_id in (select driver_id
                    from person natural join owns
                    where driver_id = '12345')

 * sqlite:///insurance.db
Done.

[]

In [17]:
%%sql 
select * from owns

 * sqlite:///insurance.db
Done.

[('29538', 'AABB2000'),
 ('58033', 'TDWU0421'),
 ('82592', 'CSYF1980'),
 ('78608', 'OMSH1732')]

In [18]:
%%sql /*Problem 7*/
update participated set damage_amount='3000' 
where license_plate='AABB2000' and report_number = 'AR2197'

 * sqlite:///insurance.db
Done.

[]

In [19]:
%%sql
select * from participated
where license_plate='AABB2000' and report_number = 'AR2197'

 * sqlite:///insurance.db
Done.

[('AR2197', 'AABB2000', '29538', 3000)]

In [20]:
%%sql
select * from participated

 * sqlite:///insurance.db
Done.

[('QW2197', 'TDWU0421', '58033', 1700),
 ('HE4884', 'UFNE8210', '12345', 2300),
 ('AR2197', 'AABB2000', '29538', 3000),
 ('XE8732', 'CSYF1980', '82592', 2100),
 ('HU2309', 'OMSH1732', '78608', 500)]